# Formulae:

brew "btop"
brew "ca-certificates"
brew "eza"
brew "fdupes"
brew "ffmpeg"
brew "git"
brew "iperf3"
brew "lolcat"
brew "midnight-commander"
brew "nano"
brew "nanorc"
brew "python@3.10"
brew "python@3.12"
brew "python@3.13"
brew "starship"
brew "stats"
tap "cirruslabs/cli"
brew "cirruslabs/cli/tart"
brew "telnet"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks: System
cask "alt-tab"
cask "angry-ip-scanner"
cask "bartender"
cask "font-meslo-lg-nerd-font"
cask "hazeover"
# cask "istat-menus"
cask "latest"
cask "miniconda"
cask "powershell"
cask "tailscale"
cask "wezterm"

# Casks: Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Casks: Media
cask "audacity"
cask "emby"
cask "handbrake"
cask "iina"
cask "vlc"
cask "xnviewmp"

# Casks: File Management
cask "a-better-finder-attributes"
cask "balenaetcher"
cask "keka"
cask "raspberry-pi-imager"
cask "syncthing"
cask "transnomino"
# Casks: Productivity
cask "chatgpt"
cask "db-browser-for-sqlite"
cask "git-credential-manager"
cask "mqtt-explorer"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "qbittorrent"
cask "rustdesk"
cask "signal"
cask "yubico-yubikey-manager"
cask "zed"

# App Store applications
mas "Affinity Publisher", id: 1606941598
mas "Affinity Designer", id: 1616831348
mas "Affinity Photo", id: 1616822987
mas "Commander One", id: 1035236694
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957
mas "Infuse", id: 1136220934
mas "Pixelmator Pro", id: 1289583905
mas "WiFi Explorer", id: 494803304
mas "Windows App", id: 1295203466
mas "Yubico Authenticator", id: 1497506650
